9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
// Serial Terminal (VT100) — Raspberry Pi soros konzol az ESP32-2432S022C-n
// ========================================================================
// Valódi VT100/ANSI terminál: karakterrács + kurzor + escape-szekvenciák
// (kurzormozgás, törlés, görgetés, SGR színek/attribútumok). A rácsot egyedi
// LVGL rajzolással jelenítjük meg, monospace UNSCII 8x8 fonttal.
//
// BEKÖTÉS a Raspberry Pi-hez (a panel P1 / "4P 1.25 Power supply base" portja,
// UART0): Pi TXD -> RXD(GPIO3), Pi RXD <- TXD(GPIO1), GND <-> GND. 3.3V logika.
// Az app NEM ír debug üzenetet az UART0-ra, hogy ne zavarja a kapcsolatot.

#include <Arduino.h>
#include <esp32_smartdisplay.h>
#include <esp_lcd_panel_ops.h>

#include "bt_input.h"
#include "config.h"
#include "launcher_return.h"
#include "vt100.h"

#define BT_NAME "CYD-Terminal"

static TermConfig cfg;
static Vt100 vt;

// Kis monospace font (DejaVu Sans Mono, 9px) — keskenyebb, mint az UNSCII 8x8,
// így több oszlop fér ki. Cella: 6 px széles x 10 px magas (a font line_height-ja).
extern const lv_font_t term_font;
static constexpr int CELL_W = 6;
static constexpr int CELL_H = 10;
static constexpr int TOP_H = 24; // állapotsor
static constexpr int BAR_H = 40; // eszköztár

// --- UI elemek -------------------------------------------------------------
static lv_obj_t *term_obj = nullptr;   // egyedi rajzolású terminál
static lv_obj_t *status_lbl = nullptr;
static lv_obj_t *kb_overlay = nullptr;
static lv_obj_t *input_ta = nullptr;
static lv_obj_t *set_overlay = nullptr;
static lv_obj_t *dd_baud = nullptr;
static lv_obj_t *dd_le = nullptr;
static lv_obj_t *sw_echo = nullptr;
static lv_obj_t *dd_rot = nullptr;

static bool g_rebuild = false;

static int32_t scrW() { return lv_display_get_horizontal_resolution(NULL); }
static int32_t scrH() { return lv_display_get_vertical_resolution(NULL); }
static int32_t imin(int32_t a, int32_t b) { return a < b ? a : b; }

static void build_ui();
static void show_keys();

static void update_status()
{
    static const char *le_short[] = {"-", "LF", "CRLF", "CR"};
    if (vt.scroll() > 0)
        lv_label_set_text_fmt(status_lbl, LV_SYMBOL_UP " SCROLL -%d/%d  (drag)",
                              vt.scroll(), vt.scrollbackCount());
    else
        lv_label_set_text_fmt(status_lbl,
                              LV_SYMBOL_USB " RPi %lu 8N1 %s%s %dx%d",
                              (unsigned long)cfg.baud,
                              le_short[cfg.lineEnding <= 3 ? cfg.lineEnding : 0],
                              cfg.localEcho ? " echo" : "", vt.cols(), vt.rows());
}

// --- Általános modális popup (üzenet / passkey) ----------------------------

static lv_obj_t *s_popup = nullptr;

static void close_popup()
{
    if (s_popup)
    {
        lv_obj_delete(s_popup);
        s_popup = nullptr;
    }
}

static void popup_ok_cb(lv_event_t *) { close_popup(); }

static void show_popup(const char *title, const char *body, bool okbtn)
{
    close_popup();
    s_popup = lv_obj_create(lv_layer_top());
    lv_obj_set_size(s_popup, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_bg_color(s_popup, lv_color_black(), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(s_popup, LV_OPA_60, LV_PART_MAIN);
    lv_obj_set_style_border_width(s_popup, 0, LV_PART_MAIN);
    lv_obj_clear_flag(s_popup, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *panel = lv_obj_create(s_popup);
    lv_obj_set_size(panel, imin(216, scrW() - 10), LV_SIZE_CONTENT);
    lv_obj_set_style_max_height(panel, scrH() - 20, LV_PART_MAIN);
    lv_obj_center(panel);
    lv_obj_set_style_bg_color(panel, lv_color_hex(0x1c2530), LV_PART_MAIN);
    lv_obj_set_flex_flow(panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(panel, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    lv_obj_t *t = lv_label_create(panel);
    lv_label_set_text(t, title);
    lv_obj_set_style_text_color(t, lv_color_hex(0xFFD400), LV_PART_MAIN);
    lv_obj_set_style_text_font(t, &lv_font_montserrat_16, LV_PART_MAIN);

    lv_obj_t *m = lv_label_create(panel);
    lv_label_set_text(m, body);
    lv_label_set_long_mode(m, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(m, LV_PCT(100));
    lv_obj_set_style_text_align(m, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(m, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    lv_obj_set_style_text_font(m, &lv_font_montserrat_20, LV_PART_MAIN);

    if (okbtn)
    {
        lv_obj_t *ok = lv_button_create(panel);
        lv_obj_add_event_cb(ok, popup_ok_cb, LV_EVENT_CLICKED, NULL);
        lv_obj_t *l = lv_label_create(ok);
        lv_label_set_text(l, "OK");
        lv_obj_center(l);
    }
}

// --- Terminál rajzolása (egyedi LVGL draw) ---------------------------------

static void term_draw_cb(lv_event_t *e)
{
    lv_obj_t *obj = lv_event_get_target_obj(e);
    lv_layer_t *layer = lv_event_get_layer(e);
    lv_area_t area;
    lv_obj_get_content_coords(obj, &area);
    const int32_t ox = area.x1, oy = area.y1;

    lv_draw_rect_dsc_t rd;
    lv_draw_rect_dsc_init(&rd);
    rd.bg_opa = LV_OPA_COVER;

    lv_draw_letter_dsc_t ld;
    lv_draw_letter_dsc_init(&ld);
    ld.font = &term_font;
    ld.opa = LV_OPA_COVER;

    const bool live = (vt.scroll() == 0);
    for (int y = 0; y < vt.rows(); y++)
    {
        for (int x = 0; x < vt.cols(); x++)
        {
            const VtCell &c = vt.viewCell(x, y); // scrollback-figyelo
            lv_color_t fg = (c.flags & VT_FG_DEF) ? Vt100::defaultFg()
                                                  : Vt100::palette(c.fg);
            lv_color_t bg = (c.flags & VT_BG_DEF) ? Vt100::defaultBg()
                                                  : Vt100::palette(c.bg);
            bool inv = (c.flags & VT_INVERSE) != 0;
            if (live && vt.cursorVisible() && x == vt.curX() && y == vt.curY())
                inv = !inv; // kurzor csak élo nézetben

            if (inv)
            {
                lv_color_t t = fg;
                fg = bg;
                bg = t;
            }

            const int32_t cx = ox + x * CELL_W, cy = oy + y * CELL_H;

            // Háttér: csak ha nem az alap (fekete), vagy invertált/kurzor.
            if (inv || !(c.flags & VT_BG_DEF))
            {
                rd.bg_color = bg;
                lv_area_t ca = {cx, cy, cx + CELL_W - 1, cy + CELL_H - 1};
                lv_draw_rect(layer, &rd, &ca);
            }

            if (c.ch > ' ')
            {
                ld.color = fg;
                ld.unicode = c.ch;
                lv_point_t p = {cx, cy};
                lv_draw_letter(layer, &ld, &p);
            }
        }
    }
}

// --- UART <-> terminál -----------------------------------------------------

static void pump_serial()
{
    int budget = 1024;
    while (Serial.available() > 0 && budget-- > 0)
    {
        int b = Serial.read();
        if (b < 0)
            break;
        vt.feed((uint8_t)b);
    }
}

static void send_line(const char *t)
{
    if (!t)
        return;
    Serial.print(t);
    Serial.print(line_ending_suffix(cfg.lineEnding));
    if (cfg.localEcho)
    {
        vt.feedStr(t);
        vt.feed('\r');
        vt.feed('\n');
    }
    vt.scrollToBottom(); // válasz látható legyen
}

// Nyers byte-sorozat küldése (speciális billentyukhöz: nyilak, Ctrl-C, Esc...).
static void send_raw(const char *seq)
{
    if (!seq)
        return;
    Serial.write((const uint8_t *)seq, strlen(seq));
    vt.scrollToBottom();
}

