9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
// --- Képernyo-billentyuzet -------------------------------------------------

static void close_keyboard()
{
    if (kb_overlay)
    {
        lv_obj_delete(kb_overlay);
        kb_overlay = nullptr;
        input_ta = nullptr;
    }
}

static void kb_event_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) == LV_EVENT_READY)
        send_line(lv_textarea_get_text(input_ta));
    close_keyboard();
}

static void show_keyboard()
{
    if (kb_overlay)
        return;
    const int32_t W = scrW();
    const int32_t H = scrH();
    int32_t ovH = (H * 7) / 10;
    if (ovH < 150)
        ovH = 150;
    const int32_t inH = 36;

    kb_overlay = lv_obj_create(lv_layer_top());
    lv_obj_remove_style_all(kb_overlay);
    lv_obj_set_size(kb_overlay, W, ovH);
    lv_obj_align(kb_overlay, LV_ALIGN_BOTTOM_MID, 0, 0);

    input_ta = lv_textarea_create(kb_overlay);
    lv_textarea_set_one_line(input_ta, true);
    lv_textarea_set_placeholder_text(input_ta, "command...");
    lv_obj_set_size(input_ta, W, inH);
    lv_obj_align(input_ta, LV_ALIGN_TOP_MID, 0, 0);

    lv_obj_t *kb = lv_keyboard_create(kb_overlay);
    lv_obj_set_size(kb, W, ovH - inH);
    lv_obj_align(kb, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_keyboard_set_textarea(kb, input_ta);
    lv_obj_add_event_cb(kb, kb_event_cb, LV_EVENT_READY, NULL);
    lv_obj_add_event_cb(kb, kb_event_cb, LV_EVENT_CANCEL, NULL);
}

// --- Beállítások -----------------------------------------------------------

static void close_settings()
{
    if (set_overlay)
    {
        lv_obj_delete(set_overlay);
        set_overlay = nullptr;
        dd_baud = dd_le = sw_echo = dd_rot = nullptr;
    }
}

static void settings_save_cb(lv_event_t *)
{
    uint8_t oldRot = cfg.rotation;
    cfg.baud = BAUD_OPTIONS[lv_dropdown_get_selected(dd_baud)];
    cfg.lineEnding = (uint8_t)lv_dropdown_get_selected(dd_le);
    cfg.localEcho = lv_obj_has_state(sw_echo, LV_STATE_CHECKED);
    cfg.rotation = (uint8_t)lv_dropdown_get_selected(dd_rot);

    config_save(cfg);
    Serial.updateBaudRate(cfg.baud);
    close_settings();

    if (cfg.rotation != oldRot)
        g_rebuild = true;
    else
        update_status();
}

static void settings_cancel_cb(lv_event_t *) { close_settings(); }

// --- Bluetooth panel -------------------------------------------------------

static lv_obj_t *s_bt_overlay = nullptr;
static lv_obj_t *s_bt_status = nullptr;

static void bt_refresh_status()
{
    if (!s_bt_status)
        return;
    if (bt_connected())
        lv_label_set_text_fmt(s_bt_status,
                              "Status: CONNECTED\nPaired devices: %d",
                              bt_bond_count());
    else
        lv_label_set_text_fmt(s_bt_status,
                              "Status: advertising\nName: %s\nPaired devices: %d",
                              BT_NAME, bt_bond_count());
}

static void close_bt()
{
    if (s_bt_overlay)
    {
        lv_obj_delete(s_bt_overlay);
        s_bt_overlay = nullptr;
        s_bt_status = nullptr;
    }
}

static void bt_close_cb(lv_event_t *) { close_bt(); }
static void bt_repair_cb(lv_event_t *)
{
    bt_repair();
    bt_refresh_status();
}
static void bt_unpair_cb(lv_event_t *)
{
    bt_unpair_all();
    bt_refresh_status();
}

static void bt_full_btn(lv_obj_t *parent, const char *txt, lv_event_cb_t cb)
{
    lv_obj_t *b = lv_button_create(parent);
    lv_obj_set_width(b, LV_PCT(100));
    lv_obj_add_event_cb(b, cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *l = lv_label_create(b);
    lv_label_set_text(l, txt);
    lv_obj_center(l);
}

static void show_bt()
{
    if (s_bt_overlay)
        return;

    s_bt_overlay = lv_obj_create(lv_layer_top());
    lv_obj_set_size(s_bt_overlay, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_bg_color(s_bt_overlay, lv_color_black(), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(s_bt_overlay, LV_OPA_60, LV_PART_MAIN);
    lv_obj_set_style_border_width(s_bt_overlay, 0, LV_PART_MAIN);
    lv_obj_clear_flag(s_bt_overlay, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *panel = lv_obj_create(s_bt_overlay);
    lv_obj_set_size(panel, imin(224, scrW() - 10), imin(290, scrH() - 10));
    lv_obj_center(panel);
    lv_obj_set_style_bg_color(panel, lv_color_hex(0x1c2530), LV_PART_MAIN);
    lv_obj_set_flex_flow(panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    lv_obj_t *t = lv_label_create(panel);
    lv_label_set_text(t, LV_SYMBOL_BLUETOOTH "  Bluetooth");
    lv_obj_set_style_text_color(t, lv_color_hex(0x40A0FF), LV_PART_MAIN);
    lv_obj_set_style_text_font(t, &lv_font_montserrat_16, LV_PART_MAIN);

    s_bt_status = lv_label_create(panel);
    lv_label_set_long_mode(s_bt_status, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(s_bt_status, LV_PCT(100));
    lv_obj_set_style_text_color(s_bt_status, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    bt_refresh_status();

    bt_full_btn(panel, "Re-pair", bt_repair_cb);
    bt_full_btn(panel, "Clear pairing", bt_unpair_cb);
    bt_full_btn(panel, "Close", bt_close_cb);
}

static void settings_bt_cb(lv_event_t *)
{
    close_settings();
    show_bt();
}

// A szövegbeíró billentyuzet a beállításokból hívható elo.
static void settings_keyboard_cb(lv_event_t *)
{
    close_settings();
    show_keyboard();
}

// A speciális (Fn) billentyuk a beállításokból hívhatók elo.
static void settings_keys_cb(lv_event_t *)
{
    close_settings();
    show_keys();
}

static void show_settings()
{
    if (set_overlay)
        return;

    set_overlay = lv_obj_create(lv_layer_top());
    lv_obj_set_size(set_overlay, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_bg_color(set_overlay, lv_color_black(), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(set_overlay, LV_OPA_60, LV_PART_MAIN);
    lv_obj_set_style_border_width(set_overlay, 0, LV_PART_MAIN);
    lv_obj_clear_flag(set_overlay, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *panel = lv_obj_create(set_overlay);
    lv_obj_set_size(panel, imin(224, scrW() - 10), imin(300, scrH() - 10));
    lv_obj_center(panel);
    lv_obj_set_style_bg_color(panel, lv_color_hex(0x1c2530), LV_PART_MAIN);
    lv_obj_set_flex_flow(panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

