9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
    lv_obj_t *t = lv_label_create(panel);
    lv_label_set_text(t, LV_SYMBOL_SETTINGS "  Settings");
    lv_obj_set_style_text_color(t, lv_color_hex(0xFFD400), LV_PART_MAIN);
    lv_obj_set_style_text_font(t, &lv_font_montserrat_16, LV_PART_MAIN);

    lv_obj_t *lb1 = lv_label_create(panel);
    lv_label_set_text(lb1, "Baud:");
    lv_obj_set_style_text_color(lb1, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    dd_baud = lv_dropdown_create(panel);
    lv_dropdown_set_options(dd_baud, "9600\n19200\n38400\n57600\n115200\n230400");
    lv_dropdown_set_selected(dd_baud, baud_to_index(cfg.baud));
    lv_obj_set_width(dd_baud, LV_PCT(100));

    lv_obj_t *lb2 = lv_label_create(panel);
    lv_label_set_text(lb2, "Line ending (on send):");
    lv_obj_set_style_text_color(lb2, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    dd_le = lv_dropdown_create(panel);
    lv_dropdown_set_options(dd_le, "None\nLF (\\n)\nCRLF (\\r\\n)\nCR (\\r)");
    lv_dropdown_set_selected(dd_le, cfg.lineEnding <= 3 ? cfg.lineEnding : 1);
    lv_obj_set_width(dd_le, LV_PCT(100));

    lv_obj_t *row = lv_obj_create(panel);
    lv_obj_remove_style_all(row);
    lv_obj_set_size(row, LV_PCT(100), 36);
    lv_obj_set_flex_flow(row, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(row, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_t *lb3 = lv_label_create(row);
    lv_label_set_text(lb3, "Local echo");
    lv_obj_set_style_text_color(lb3, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    sw_echo = lv_switch_create(row);
    if (cfg.localEcho)
        lv_obj_add_state(sw_echo, LV_STATE_CHECKED);

    lv_obj_t *lb4 = lv_label_create(panel);
    lv_label_set_text(lb4, "Orientation:");
    lv_obj_set_style_text_color(lb4, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    dd_rot = lv_dropdown_create(panel);
    lv_dropdown_set_options(dd_rot, "Portrait (39 cols)\nLandscape (52 cols)");
    lv_dropdown_set_selected(dd_rot, cfg.rotation ? 1 : 0);
    lv_obj_set_width(dd_rot, LV_PCT(100));

    // Billentyuzet elohívása (alapból nem látszik)
    lv_obj_t *kbbtn = lv_button_create(panel);
    lv_obj_set_width(kbbtn, LV_PCT(100));
    lv_obj_add_event_cb(kbbtn, settings_keyboard_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *kbl = lv_label_create(kbbtn);
    lv_label_set_text(kbl, LV_SYMBOL_KEYBOARD "  Keyboard");
    lv_obj_center(kbl);

    // Speciális (Fn) billentyuk elohívása
    lv_obj_t *fnbtn = lv_button_create(panel);
    lv_obj_set_width(fnbtn, LV_PCT(100));
    lv_obj_add_event_cb(fnbtn, settings_keys_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *fnl = lv_label_create(fnbtn);
    lv_label_set_text(fnl, "Fn keys (arrows, Ctrl-C...)");
    lv_obj_center(fnl);

    // Bluetooth (párosítás / újrapárosítás / törlés)
    lv_obj_t *btbtn = lv_button_create(panel);
    lv_obj_set_width(btbtn, LV_PCT(100));
    lv_obj_add_event_cb(btbtn, settings_bt_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *btl = lv_label_create(btbtn);
    lv_label_set_text(btl, LV_SYMBOL_BLUETOOTH "  Bluetooth");
    lv_obj_center(btl);

    lv_obj_t *btnrow = lv_obj_create(panel);
    lv_obj_remove_style_all(btnrow);
    lv_obj_set_size(btnrow, LV_PCT(100), 50);
    lv_obj_set_flex_flow(btnrow, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(btnrow, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_t *cancel = lv_button_create(btnrow);
    lv_obj_add_event_cb(cancel, settings_cancel_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *cl = lv_label_create(cancel);
    lv_label_set_text(cl, "Cancel");
    lv_obj_t *save = lv_button_create(btnrow);
    lv_obj_add_event_cb(save, settings_save_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *sl = lv_label_create(save);
    lv_label_set_text(sl, "Save");
}

// --- Speciális billentyuk (nyers küldés a Pi-nek) --------------------------

static lv_obj_t *keys_overlay = nullptr;

static void rawkey_cb(lv_event_t *e)
{
    send_raw((const char *)lv_event_get_user_data(e));
}

static void close_keys()
{
    if (keys_overlay)
    {
        lv_obj_delete(keys_overlay);
        keys_overlay = nullptr;
    }
}

static void keys_close_cb(lv_event_t *) { close_keys(); }

// Egy speciális gomb a panelre.
static void add_key(lv_obj_t *parent, const char *label, const char *seq)
{
    lv_obj_t *b = lv_button_create(parent);
    lv_obj_set_size(b, 50, 34);
    lv_obj_add_event_cb(b, rawkey_cb, LV_EVENT_CLICKED, (void *)seq);
    lv_obj_t *l = lv_label_create(b);
    lv_label_set_text(l, label);
    lv_obj_center(l);
}

static void show_keys()
{
    if (keys_overlay)
        return;
    const int32_t W = scrW();

    keys_overlay = lv_obj_create(lv_layer_top());
    lv_obj_set_size(keys_overlay, W, 150);
    lv_obj_align(keys_overlay, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_obj_set_style_bg_color(keys_overlay, lv_color_hex(0x1c2530), LV_PART_MAIN);
    lv_obj_set_flex_flow(keys_overlay, LV_FLEX_FLOW_ROW_WRAP);
    lv_obj_set_flex_align(keys_overlay, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_all(keys_overlay, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_gap(keys_overlay, 4, LV_PART_MAIN);

    add_key(keys_overlay, "Esc", "\x1b");
    add_key(keys_overlay, "Tab", "\t");
    add_key(keys_overlay, LV_SYMBOL_UP, "\x1b[A");
    add_key(keys_overlay, "^C", "\x03");
    add_key(keys_overlay, LV_SYMBOL_LEFT, "\x1b[D");
    add_key(keys_overlay, LV_SYMBOL_DOWN, "\x1b[B");
    add_key(keys_overlay, LV_SYMBOL_RIGHT, "\x1b[C");
    add_key(keys_overlay, "^D", "\x04");
    add_key(keys_overlay, "^Z", "\x1a");
    add_key(keys_overlay, "Bksp", "\x7f");
    add_key(keys_overlay, LV_SYMBOL_OK, "\r"); // Enter

    lv_obj_t *cl = lv_button_create(keys_overlay);
    lv_obj_set_size(cl, 50, 34);
    lv_obj_add_event_cb(cl, keys_close_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *cll = lv_label_create(cl);
    lv_label_set_text(cll, LV_SYMBOL_CLOSE);
    lv_obj_center(cll);
}

// --- Húzás-görgetés (scrollback) -------------------------------------------

