9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
static int s_dragY = 0, s_dragScroll = 0;

static void term_press_cb(lv_event_t *e)
{
    lv_indev_t *indev = lv_indev_active();
    if (!indev)
        return;
    lv_point_t p;
    lv_indev_get_point(indev, &p);

    if (lv_event_get_code(e) == LV_EVENT_PRESSED)
    {
        s_dragY = p.y;
        s_dragScroll = vt.scroll();
    }
    else // PRESSING
    {
        int lines = (p.y - s_dragY) / CELL_H; // lefelé húzás -> régebbi sorok
        vt.setScroll(s_dragScroll + lines);
        update_status();
        lv_obj_invalidate(term_obj);
    }
}

// --- Eszköztár -------------------------------------------------------------

static void btn_cfg_cb(lv_event_t *) { show_settings(); }
static void btn_clear_cb(lv_event_t *)
{
    vt.reset();
    lv_obj_invalidate(term_obj);
}
static void btn_exit_cb(lv_event_t *) { return_to_launcher(); }

static void apply_rotation()
{
    lv_display_set_rotation(lv_display_get_default(),
                            cfg.rotation ? LV_DISPLAY_ROTATION_90
                                         : LV_DISPLAY_ROTATION_0);
}

// Néhány ESP32-2432S022C panelnél a kijelzot expliciten be kell kapcsolni
// (DISPON) az init után, különben csak fehér hátteret látni (nincs kép).
static void display_force_on()
{
    auto *panel = (esp_lcd_panel_handle_t)lv_display_get_user_data(
        lv_display_get_default());
    if (panel)
        esp_lcd_panel_disp_on_off(panel, true);
}

static void make_tool_btn(lv_obj_t *parent, const char *sym, lv_event_cb_t cb)
{
    lv_obj_t *b = lv_button_create(parent);
    lv_obj_set_flex_grow(b, 1);
    lv_obj_set_height(b, LV_PCT(100));
    lv_obj_add_event_cb(b, cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *l = lv_label_create(b);
    lv_label_set_text(l, sym);
    lv_obj_center(l);
}

static void build_ui()
{
    const int32_t W = scrW();
    const int32_t H = scrH();

    lv_obj_t *scr = lv_screen_active();
    lv_obj_set_style_bg_color(scr, lv_color_hex(0x000000), LV_PART_MAIN);
    lv_obj_set_style_pad_all(scr, 0, LV_PART_MAIN);

    status_lbl = lv_label_create(scr);
    lv_obj_set_style_text_color(status_lbl, lv_color_hex(0x6ff0a0), LV_PART_MAIN);
    lv_obj_set_style_text_font(status_lbl, &lv_font_montserrat_12, LV_PART_MAIN);
    lv_obj_align(status_lbl, LV_ALIGN_TOP_LEFT, 4, 5);

    // Terminál-objektum (egyedi rajzolás). Kis margó, hogy a szélso oszlopok/
    // sorok ne lógjanak le a kijelzorol.
    const int32_t PADH = 3, PADV = 2;
    const int32_t termW = W;
    const int32_t termH = H - TOP_H - BAR_H;
    term_obj = lv_obj_create(scr);
    lv_obj_remove_style_all(term_obj);
    lv_obj_set_pos(term_obj, 0, TOP_H);
    lv_obj_set_size(term_obj, termW, termH);
    lv_obj_set_style_bg_color(term_obj, Vt100::defaultBg(), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(term_obj, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_pad_left(term_obj, PADH, LV_PART_MAIN);
    lv_obj_set_style_pad_right(term_obj, PADH, LV_PART_MAIN);
    lv_obj_set_style_pad_top(term_obj, PADV, LV_PART_MAIN);
    lv_obj_set_style_pad_bottom(term_obj, PADV, LV_PART_MAIN);
    lv_obj_clear_flag(term_obj, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(term_obj, LV_OBJ_FLAG_CLICKABLE); // húzás-görgetéshez
    lv_obj_add_event_cb(term_obj, term_draw_cb, LV_EVENT_DRAW_MAIN_END, NULL);
    lv_obj_add_event_cb(term_obj, term_press_cb, LV_EVENT_PRESSED, NULL);
    lv_obj_add_event_cb(term_obj, term_press_cb, LV_EVENT_PRESSING, NULL);

    // A rács mérete a (paddinggal csökkentett) tartalom-területbol.
    vt.resize((termW - 2 * PADH) / CELL_W, (termH - 2 * PADV) / CELL_H);

    // Eszköztár
    lv_obj_t *bar = lv_obj_create(scr);
    lv_obj_remove_style_all(bar);
    lv_obj_set_size(bar, W, BAR_H);
    lv_obj_align(bar, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_obj_set_flex_flow(bar, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(bar, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_column(bar, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_all(bar, 3, LV_PART_MAIN);
    // A billentyuzet és az Fn billentyuk a ⚙ beállításokból hívhatók elo.
    make_tool_btn(bar, LV_SYMBOL_SETTINGS, btn_cfg_cb);
    make_tool_btn(bar, LV_SYMBOL_TRASH, btn_clear_cb);
    make_tool_btn(bar, LV_SYMBOL_LEFT, btn_exit_cb);

    update_status();
}

static void rebuild_ui()
{
    apply_rotation();
    lv_obj_clean(lv_screen_active());
    build_ui();
}

void setup()
{
    config_load(cfg);
    Serial.begin(cfg.baud); // UART0 a Pi felé (P1: TX=GPIO1, RX=GPIO3)

    smartdisplay_init();
    display_force_on();
    apply_rotation();
    build_ui();

    bt_init(BT_NAME); // BLE bemenet + hirdetés

    vt.feedStr("VT100 terminal ready.\r\n");
    vt.feedStr("Pi -> P1 port (TX=GPIO1, RX=GPIO3, GND).\r\n");
    vt.feedStr("BT: " BT_NAME " (pair in Settings).\r\n\n");
}

// BLE párosítási visszajelzések kezelése (a fo loopból).
static void bt_poll_ui()
{
    static uint32_t shownPk = 0;
    uint32_t pk = bt_passkey();
    if (pk && pk != shownPk)
    {
        shownPk = pk;
        char b[64];
        snprintf(b, sizeof(b), "Code:\n%06u\n\nEnter it on your device", (unsigned)pk);
        show_popup("Bluetooth pairing", b, false);
    }

    bool ok;
    if (bt_take_auth_result(&ok))
    {
        shownPk = 0;
        close_popup();
        show_popup("Bluetooth", ok ? "Paired successfully!" : "Pairing failed", true);
        if (s_bt_status)
            bt_refresh_status();
    }
}

static uint32_t last_tick = 0;
static uint32_t last_draw = 0;
static constexpr uint32_t REDRAW_MS = 40; // ~25 fps — a gyors kimenetet összevonja

void loop()
{
    uint32_t now = millis();
    lv_tick_inc(now - last_tick);
    last_tick = now;

    if (g_rebuild)
    {
        g_rebuild = false;
        rebuild_ui();
    }

    // BLE-rol érkezo karakterek -> a Pi felé (mint a billentyuzet), ÉS helyben
    // megjelenítve a CYD kijelzon. Csak nyomtathatót + sortörést echózunk, hogy
    // az esetleges ESC/vezérlo-szekvenciák ne rontsák el a helyi terminálképet.
    uint8_t bb[64];
    int bn = bt_read(bb, sizeof(bb));
    if (bn > 0)
    {
        Serial.write(bb, bn); // natúr a Pi felé
        for (int i = 0; i < bn; i++)
        {
            uint8_t b = bb[i];
            if ((b >= 0x20 && b < 0x7F) || b == '\n' || b == '\r' || b == '\t')
                vt.feed(b); // helyi megjelenítés
        }
        vt.scrollToBottom();
    }
    bt_poll_ui();

    pump_serial();

    // Throttle: a bejövo adatot összevonjuk, és legfeljebb ~25 fps-sel rajzolunk
    // újra. Így a gyors konzol-kimenet gördülékeny marad (nem rajzol minden byte-ra).
    if (vt.dirty() && (now - last_draw) >= REDRAW_MS)
    {
        vt.clearDirty();
        last_draw = now;
        lv_obj_invalidate(term_obj);
    }

    lv_timer_handler();
    delay(2);
}
